mithunbabbira/fleet_manager/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"
# CONFIG_BT_ENABLED is not set
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
# Dual-bank OTA: boot new image as pending-verify; app must mark valid or rollback.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
# ESP32-C6 Mini is typically used over USB-Serial/JTAG (cu.usbmodem*), not UART0 pins.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# CONFIG_ESP_CONSOLE_UART_DEFAULT is not set
CONFIG_ELM_CMD_TIMEOUT_MS=12000
# EC200U on UART1 GPIO17 TX / GPIO16 RX (Airtel APN confirmed on host probe)
CONFIG_NET_LTE_ENABLE=y
CONFIG_NET_LTE_APN="airtelgprs.com"
# LTE OTA auto-check (default lab ngrok; override via SoftAP/NVS or change here for CM)
CONFIG_FW_OTA_LTE_AUTO_CHECK=y
CONFIG_FW_OTA_LTE_DEFAULT_MANIFEST_URL="https://d949-2402-e280-210a-4bd-88a5-efd3-8de3-4a38.ngrok-free.app/firmware/manifest"
CONFIG_FW_OTA_LTE_AUTO_WAIT_SEC=90
CONFIG_FW_OTA_LTE_AUTO_INTERVAL_H=24
CONFIG_ELM_SOFTAP_SSID="Fleet-C6"
CONFIG_ELM_SOFTAP_PASS="fleetc6"
